Repository: rxhfcy/Asahi-Restart-Helper--macOS-version
Catalog: Asahi Restart Helper/*.lproj/Localizable.strings
Languages: fi

# RestartConfirmationDialog.OnlyTwoDisks.Linux
source: Restart in Linux...
fi: Käynnistä uudelleen Linuxissa...

# RestartConfirmationDialog.OnlyTwoDisks.macOS
source: Restart macOS...
fi: Käynnistä macOS uudelleen...

# RestartConfirmationDialog.CurrentDefault
source: (current default)
fi: (oletus)

# RestartConfirmationDialog.ChangeStartupDisk
source: Change default 'Startup Disk'
fi: Vaihda "käynnistyslevy"-oletus

# RestartConfirmationDialog.Preferences
source: Preferences...
fi: Asetukset...

# RestartConfirmationDialog.IsNext
source: ("%@" will start up next)
fi: ("%@" käynnistyy seuraavaksi)

# RestartConfirmationDialog.UseDisk
source: Use "%@"...
fi: Käytä levyä "%@"...

# RestartConfirmationDialog.Title
source: Are you sure you want to restart now?
fi: Haluatko varmasti käynnistää tietokoneen uudelleen?

# RestartConfirmationDialog.Warning
source: Unsaved changes may be lost when restarting
fi: Tallentamattomat muutokset voidaan menettää uudelleenkäynnistettäessä

# RestartConfirmationDialog.WarningTooltip
source: It can't be guaranteed that current windows will reopen upon next macOS login
fi: Avoimien ikkunoiden palautuminen uudelleenkäynnistyksen jälkeen ei ole varmaa

# RestartConfirmationDialog.RestartButton
source: Restart...
fi: Käynnistä uudelleen...

# RestartConfirmationDialog.RestartWithoutPasswordButton
source: Restart now!
fi: Käynnistä uudelleen nyt!

# RestartConfirmationDialog.CancelButton
source: Cancel
fi: Kumoa

# StartupDiskConfirmationDialog.Title
source: Change default 'Startup Disk' setting?
fi: Vaihda oletuksena käytettävä "käynnistyslevy"?

# StartupDiskConfirmationDialog.Info
source: "%@" will become the new default 'Startup Disk'.
fi: Uusi oletuksena käytettävä "käynnistyslevy": "%@"

# StartupDiskConfirmationDialog.Explanation
source: The 'Startup Disk' is the disk always used by default for starting up an Apple computer (after a "normal" restart or a shutdown).
fi: "Käynnistyslevy" on levy, jota Apple-tietokone aina oletusarvoisesti käyttää käynnistyessään ("tavallisen" uudelleenkäynnistyksen tai sammuttamisen jälkeen).

# StartupDiskConfirmationDialog.Change
source: Change
fi: Vaihda

# StartupDiskConfirmationDialog.Cancel
source: Cancel
fi: Peruuta

# PreferencesDialog.Title
source: Asahi Restart Helper - Preferences
fi: Asahi-uudelleenkäynnistysapuri - Asetukset

# PreferencesDialog.AutoStartToggleLabel
source: Show macOS menubar icon (launch at login)
fi: Pidä kuvake macOS-valikkopalkissa käynnistyksen jälkeen

# PreferencesDialog.AutoStartToggleLabelTooltip
source: If enabled, the app will be included in Login Items. This will show the icon after every macOS login.
fi: Määrää, sisällytetäänkö ohjelma järjestelmän kirjautumiskohteisiin. Näyttää kuvakkeen jokaisen macOS-käynnistyksen jälkeen.

# PreferencesDialog.HelperAppToggleLabel
source: Bypass password prompts (installs a privileged tool)
fi: Ohita salasanakysymykset (asentaa järjestelmätyökalun)

# PreferencesDialog.HelperAppToggleLabelTooltip
source: Install or uninstall the privileged tool to allow password-free usage
fi: Asenna tai poista järjestelmätyökalu, joka mahdollistaa ohjelman käyttämisen ilman salasanan kirjoittamista

# PreferencesDialog.CloseButton
source: Done
fi: Valmis

# PreferencesDialog.QuitButton
source: Quit app
fi: Lopeta ohjelma

# HelpDialog.Title
source: Help
fi: Apua

# HelpDialog.Text
source: (Add help text here)
fi: (Lisää ohjeteksti tänne)

# HelpDialog.CloseButton
source: Dismiss
fi: Sulje
